levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32f165_ll_interrupts_share.c
/**
 * @brief  Interrupt No.028 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ028_Handler(void)
{
    uint32_t u32Tmp1;
    /* DMA Ch.4 transfer complete */
    if (0UL == bCM_DMA->INTMASK1_b.MSKTC4) {
        u32Tmp1 = bCM_DMA->INTSTAT1_b.TC4;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL1) && (0UL != u32Tmp1)) {
            DMA_TC4_IrqHandler();
        }
    }
    /* DMA Ch.4 block transfer complete */
    if (0UL == bCM_DMA->INTMASK1_b.MSKBTC4) {
        u32Tmp1 = bCM_DMA->INTSTAT1_b.BTC4;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL2) && (0UL != u32Tmp1)) {
            DMA_BTC4_IrqHandler();
        }
    }
    /* Timer4 overflow */
    if (1UL == bCM_TMR4->CCSR_b.IRQPEN) {
        u32Tmp1 = bCM_TMR4->CCSR_b.IRQPF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL4) && (0UL != u32Tmp1)) {
            TMR4_Ovf_IrqHandler();
        }
    }
    /* Timer4 underflow */
    if (1UL == bCM_TMR4->CCSR_b.IRQZEN) {
        u32Tmp1 = bCM_TMR4->CCSR_b.IRQZF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL5) && (0UL != u32Tmp1)) {
            TMR4_Udf_IrqHandler();
        }
    }
    /* USART5 Tx buffer empty */
    if (1UL == bCM_USART5->CR1_b.TXEIE) {
        u32Tmp1 = bCM_USART5->SR_b.TXE;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL7) && (0UL != u32Tmp1)) {
            USART5_TxEmpty_IrqHandler();
        }
    }
    /* TimerB3 overflow */
    if (1UL == bCM_TMRB_3->BCSTRH_b.ITENOVF) {
        u32Tmp1 = bCM_TMRB_3->BCSTRH_b.OVFF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL8) && (0UL != u32Tmp1)) {
            TMRB_3_Ovf_IrqHandler();
        }
    }
    /* TimerB3 underflow */
    if (1UL == bCM_TMRB_3->BCSTRH_b.ITENUDF) {
        u32Tmp1 = bCM_TMRB_3->BCSTRH_b.UDFF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL9) && (0UL != u32Tmp1)) {
            TMRB_3_Udf_IrqHandler();
        }
    }
    /* TimerB4 compare match */
    if (1UL == bCM_TMRB_4->ICONR_b.ITEN1) {
        u32Tmp1 = bCM_TMRB_4->STFLR_b.CMPF1;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL10) && (0UL != u32Tmp1)) {
            TMRB_4_Cmp_IrqHandler();
        }
    }
    /* ADC seq.A convert complete */
    if (1UL == bCM_ADC->ICR_b.EOCAIEN) {
        u32Tmp1 = bCM_ADC->ISR_b.EOCAF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL11) && (0UL != u32Tmp1)) {
            ADC_SeqA_IrqHandler();
        }
    }
    /* USART2 Rx ORE/FE/PE error */
    if (1UL == bCM_USART2->CR1_b.RIE) {
        u32Tmp1 = CM_USART2->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL12) && (0UL != u32Tmp1)) {
            USART2_RxError_IrqHandler();
        }
    }
    /* USART3 Tx buffer empty */
    if (1UL == bCM_USART3->CR1_b.TXEIE) {
        u32Tmp1 = bCM_USART3->SR_b.TXE;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL13) && (0UL != u32Tmp1)) {
            USART3_TxEmpty_IrqHandler();
        }
    }
    /* I2C1 Tx end */
    if (1UL == bCM_I2C1->CR2_b.TENDIE) {
        u32Tmp1 = bCM_I2C1->SR_b.TENDF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL14) && (0UL != u32Tmp1)) {
            I2C1_TxComplete_IrqHandler();
        }
    }
    /* SPI bus idle */
    if (1UL == bCM_SPI1->CR1_b.IDIE) {
        u32Tmp1 = bCM_SPI1->SR_b.IDLNF;
        if ((1UL == bCM_INTC->ISELBR28_b.ISEL15) && (0UL == u32Tmp1)) {
            SPI1_Idle_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.029 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ029_Handler(void)
{
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    /* SPI ch.2 Tx buffer empty */
    if (1UL == bCM_SPI2->CR1_b.TXIE) {
        u32Tmp1 = bCM_SPI2->SR_b.TDEF;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL1) && (0UL != u32Tmp1)) {
            SPI2_TxEmpty_IrqHandler();
        }
    }
    /* DMA Ch.5 transfer complete */
    if (0UL == bCM_DMA->INTMASK1_b.MSKTC5) {
        u32Tmp1 = bCM_DMA->INTSTAT1_b.TC5;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL2) && (0UL != u32Tmp1)) {
            DMA_TC5_IrqHandler();
        }
    }
    /* DMA Ch.5 block transfer complete */
    if (0UL == bCM_DMA->INTMASK1_b.MSKBTC5) {
        u32Tmp1 = bCM_DMA->INTSTAT1_b.BTC5;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL3) && (0UL != u32Tmp1)) {
            DMA_BTC5_IrqHandler();
        }
    }
    /* External interrupt 10 */
    u32Tmp1 = bCM_INTC->EIRQFR_b.EIRQF10;
    if ((1UL == bCM_INTC->ISELBR29_b.ISEL5) && (0UL != u32Tmp1)) {
        EXTINT10_IrqHandler();
    }
    /* USART6 Tx buffer empty */
    if (1UL == bCM_USART6->CR1_b.TXEIE) {
        u32Tmp1 = bCM_USART6->SR_b.TXE;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL7) && (0UL != u32Tmp1)) {
            USART6_TxEmpty_IrqHandler();
        }
    }
    /* TimerB4 overflow */
    if (1UL == bCM_TMRB_4->BCSTRH_b.ITENOVF) {
        u32Tmp1 = bCM_TMRB_4->BCSTRH_b.OVFF;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL8) && (0UL != u32Tmp1)) {
            TMRB_4_Ovf_IrqHandler();
        }
    }
    /* TimerB4 underflow */
    if (1UL == bCM_TMRB_4->BCSTRH_b.ITENUDF) {
        u32Tmp1 = bCM_TMRB_4->BCSTRH_b.UDFF;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL9) && (0UL != u32Tmp1)) {
            TMRB_4_Udf_IrqHandler();
        }
    }
    /* TimerB3 compare match */
    if (1UL == bCM_TMRB_3->ICONR_b.ITEN1) {
        u32Tmp1 = bCM_TMRB_3->STFLR_b.CMPF1;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL10) && (0UL != u32Tmp1)) {
            TMRB_3_Cmp_IrqHandler();
        }
    }
    /* ADC seq.B convert complete */
    if (1UL == bCM_ADC->ICR_b.EOCBIEN) {
        u32Tmp1 = bCM_ADC->ISR_b.EOCBF;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL11) && (0UL != u32Tmp1)) {
            ADC_SeqB_IrqHandler();
        }
    }
    /* USART2 Rx end */
    if (1UL == bCM_USART2->CR1_b.RIE) {
        u32Tmp1 = bCM_USART2->SR_b.RXNE;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL12) && (0UL != u32Tmp1)) {
            USART2_RxFull_IrqHandler();
        }
    }
    /* USART3 Tx end */
    if (1UL == bCM_USART3->CR1_b.TCIE) {
        u32Tmp1 = bCM_USART3->SR_b.TC;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL13) && (0UL != u32Tmp1)) {
            USART3_TxComplete_IrqHandler();
        }
    }
    /* I2C1 Rx end */
    if (1UL == bCM_I2C1->CR2_b.RFULLIE) {
        u32Tmp1 = bCM_I2C1->SR_b.RFULLF;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL14) && (0UL != u32Tmp1)) {
            I2C1_RxFull_IrqHandler();
        }
    }
    /*DCU */
    if (1UL == bCM_DCU->CTL_b.INTEN) {
        u32Tmp1 = CM_DCU->INTEVTSEL;
        u32Tmp2 = CM_DCU->FLAG;
        if ((1UL == bCM_INTC->ISELBR29_b.ISEL15) && (0UL != (u32Tmp1 & u32Tmp2 & 0x0E7FUL))) {
            DCU_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.030 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ030_Handler(void)
{
    uint32_t u32Tmp1;
    /* DMA Ch.6 transfer complete */
    if (0UL == bCM_DMA->INTMASK1_b.MSKTC6) {
        u32Tmp1 = bCM_DMA->INTSTAT1_b.TC6;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL2) && (0UL != u32Tmp1)) {
            DMA_TC6_IrqHandler();
        }
    }
    /* DMA Ch.6 block transfer complete */
    if (0UL == bCM_DMA->INTMASK1_b.MSKBTC6) {
        u32Tmp1 = bCM_DMA->INTSTAT1_b.BTC6;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL3) && (0UL != u32Tmp1)) {
            DMA_BTC6_IrqHandler();
        }
    }
    /* External interrupt 11 */
    u32Tmp1 = bCM_INTC->EIRQFR_b.EIRQF11;
    if ((1UL == bCM_INTC->ISELBR30_b.ISEL5) && (0UL != u32Tmp1)) {
        EXTINT11_IrqHandler();
    }
    /* USART5 Tx end */
    if (1UL == bCM_USART5->CR1_b.TCIE) {
        u32Tmp1 = bCM_USART5->SR_b.TC;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL7) && (0UL != u32Tmp1)) {
            USART5_TxComplete_IrqHandler();
        }
    }
    /* TimerB1 overflow */
    if (1UL == bCM_TMRB_1->BCSTRH_b.ITENOVF) {
        u32Tmp1 = bCM_TMRB_1->BCSTRH_b.OVFF;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL8) && (0UL != u32Tmp1)) {
            TMRB_1_Ovf_IrqHandler();
        }
    }
    /* TimerB1 underflow */
    if (1UL == bCM_TMRB_1->BCSTRH_b.ITENUDF) {
        u32Tmp1 = bCM_TMRB_1->BCSTRH_b.UDFF;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL9) && (0UL != u32Tmp1)) {
            TMRB_1_Udf_IrqHandler();
        }
    }
    /* TimerB2 compare match */
    if (1UL == bCM_TMRB_2->ICONR_b.ITEN1) {
        u32Tmp1 = bCM_TMRB_2->STFLR_b.CMPF1;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL10) && (0UL != u32Tmp1)) {
            TMRB_2_Cmp_IrqHandler();
        }
    }
    /* ADC convert result in range of window 0 setting */
    if (1UL == bCM_ADC->AWDCR_b.AWD0IEN) {
        u32Tmp1 = bCM_ADC->AWDSR_b.AWD0F;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL11) && (0UL != u32Tmp1)) {
            ADC_Cmp0_IrqHandler();
        }
    }
    /* USART2 Tx buffer empty */
    if (1UL == bCM_USART2->CR1_b.TXEIE) {
        u32Tmp1 = bCM_USART2->SR_b.TXE;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL12) && (0UL != u32Tmp1)) {
            USART2_TxEmpty_IrqHandler();
        }
    }
    /* I2C1 Tx buffer empty */
    if (1UL == bCM_I2C1->CR2_b.TEMPTYIE) {
        u32Tmp1 = bCM_I2C1->SR_b.TEMPTYF;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL13) && (0UL != u32Tmp1)) {
            I2C1_TxEmpty_IrqHandler();
        }
    }
    /* SPI2 bus idle */
    if (1UL == bCM_SPI2->CR1_b.IDIE) {
        u32Tmp1 = bCM_SPI2->SR_b.IDLNF;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL14) && (0UL == u32Tmp1)) {
            SPI2_Idle_IrqHandler();
        }
    }
    /* USART4 Tx buffer empty */
    if (1UL == bCM_USART4->CR1_b.TXEIE) {
        u32Tmp1 = bCM_USART4->SR_b.TXE;
        if ((1UL == bCM_INTC->ISELBR30_b.ISEL15) && (0UL != u32Tmp1)) {
            USART4_TxEmpty_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.031 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ031_Handler(void)
{
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    /* LVD detected */
    if (0UL == bCM_EFM->LVDICGCR_b.LVDDIS) {
        u32Tmp1 = bCM_PWC->LVDCSR_b.DETF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL2) && (0UL != u32Tmp1)) {
            PWC_LVD_IrqHandler();
        }
    }
    /* USART6 Tx end */
    if (1UL == bCM_USART6->CR1_b.TCIE) {
        u32Tmp1 = bCM_USART6->SR_b.TC;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL3) && (0UL != u32Tmp1)) {
            USART6_TxComplete_IrqHandler();
        }
    }
    /* EFM operate end */
    if (1UL == bCM_EFM->FITE_b.OPTENDITE) {
        u32Tmp1 = bCM_EFM->FSR_b.OPTEND;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL4) && (0UL != u32Tmp1)) {
            EFM_OpEnd_IrqHandler();
        }
    }
    /* RTC alarm */
    if (1UL == bCM_RTC->CR2_b.ALMIE) {
        u32Tmp1 = bCM_RTC->CR2_b.ALMF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL5) && (0UL != u32Tmp1)) {
            RTC_Alarm_IrqHandler();
        }
    }
    /* RTC period */
    if (1UL == bCM_RTC->CR2_b.PRDIE) {
        u32Tmp1 = bCM_RTC->CR2_b.PRDF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL6) && (0UL != u32Tmp1)) {
            RTC_Period_IrqHandler();
        }
    }
    /* TimerB2 overflow */
    if (1UL == bCM_TMRB_2->BCSTRH_b.ITENOVF) {
        u32Tmp1 = bCM_TMRB_2->BCSTRH_b.OVFF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL8) && (0UL != u32Tmp1)) {
            TMRB_2_Ovf_IrqHandler();
        }
    }
    /* TimerB2 underflow */
    if (1UL == bCM_TMRB_2->BCSTRH_b.ITENUDF) {
        u32Tmp1 = bCM_TMRB_2->BCSTRH_b.UDFF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL9) && (0UL != u32Tmp1)) {
            TMRB_2_Udf_IrqHandler();
        }
    }
    /* TimerB1 compare match */
    if (1UL == bCM_TMRB_1->ICONR_b.ITEN1) {
        u32Tmp1 = bCM_TMRB_1->STFLR_b.CMPF1;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL10) && (0UL != u32Tmp1)) {
            TMRB_1_Cmp_IrqHandler();
        }
    }
    if (1UL == bCM_ADC->AWDCR_b.AWD1IEN) {
        /* ADC convert result in range of window 1 if independence use */
        u32Tmp1 = bCM_ADC->AWDSR_b.AWD1F;
        u32Tmp2 = (uint32_t)CM_ADC->AWDCR & (uint32_t)ADC_AWDCR_AWDCM;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL11) && (0UL != u32Tmp1) && (0UL == u32Tmp2)) {
            ADC_Cmp1_IrqHandler();
        }
        /* ADC convert result combination use of window 0 & 1 */
        u32Tmp1 = bCM_ADC->AWDSR_b.AWDCMF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL11) && (0UL != u32Tmp1) && (0UL != u32Tmp2)) {
            ADC_Cmp1_IrqHandler();
        }
    }
    /* USART2 Tx end */
    if (1UL == bCM_USART2->CR1_b.TCIE) {
        u32Tmp1 = bCM_USART2->SR_b.TC;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL12) && (0UL != u32Tmp1)) {
            USART2_TxComplete_IrqHandler();
        }
    }
    /* USART4 Tx end */
    if (1UL == bCM_USART4->CR1_b.TCIE) {
        u32Tmp1 = bCM_USART4->SR_b.TC;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL13) && (0UL != u32Tmp1)) {
            USART4_TxComplete_IrqHandler();
        }
    }
    /* DMA Ch.7 transfer complete */
    if (0UL == bCM_DMA->INTMASK1_b.MSKTC7) {
        u32Tmp1 = bCM_DMA->INTSTAT1_b.TC7;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL14) && (0UL != u32Tmp1)) {
            DMA_TC7_IrqHandler();
        }
    }
    /* DMA Ch.7 block transfer complete */
    if (0UL == bCM_DMA->INTMASK1_b.MSKBTC7) {
        u32Tmp1 = bCM_DMA->INTSTAT1_b.BTC7;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL15) && (0UL != u32Tmp1)) {
            DMA_BTC7_IrqHandler();
        }
    }
    /* SPI1 Tx buffer empty */
    if (1UL == bCM_SPI1->CR1_b.TXIE) {
        u32Tmp1 = bCM_SPI1->SR_b.TDEF;
        if ((1UL == bCM_INTC->ISELBR31_b.ISEL13) && (0UL != u32Tmp1)) {
            SPI1_TxEmpty_IrqHandler();
        }
    }
}
/**
 * @}
 */

/**
 * @defgroup Share_Interrupts_Weakdef_Prototypes Share Interrupts weak function prototypes
 * @{
 */
__WEAKDEF void EXTINT08_IrqHandler(void)
{
}

__WEAKDEF void EXTINT09_IrqHandler(void)
{
}

__WEAKDEF void EXTINT10_IrqHandler(void)
{
}

__WEAKDEF void EXTINT11_IrqHandler(void)
{
}

