levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32f165_ll_interrupts_share.c
__WEAKDEF void DMA_TC0_IrqHandler(void)
{
}

__WEAKDEF void DMA_BTC0_IrqHandler(void)
{
}

__WEAKDEF void DMA_TC1_IrqHandler(void)
{
}

__WEAKDEF void DMA_BTC1_IrqHandler(void)
{
}

__WEAKDEF void DMA_TC2_IrqHandler(void)
{
}

__WEAKDEF void DMA_BTC2_IrqHandler(void)
{
}

__WEAKDEF void DMA_TC3_IrqHandler(void)
{
}

__WEAKDEF void DMA_BTC3_IrqHandler(void)
{
}

__WEAKDEF void DMA_TC4_IrqHandler(void)
{
}

__WEAKDEF void DMA_BTC4_IrqHandler(void)
{
}

__WEAKDEF void DMA_TC5_IrqHandler(void)
{
}

__WEAKDEF void DMA_BTC5_IrqHandler(void)
{
}

__WEAKDEF void DMA_TC6_IrqHandler(void)
{
}

__WEAKDEF void DMA_BTC6_IrqHandler(void)
{
}

__WEAKDEF void DMA_TC7_IrqHandler(void)
{
}

__WEAKDEF void DMA_BTC7_IrqHandler(void)
{
}

__WEAKDEF void DMA_Error_IrqHandler(void)
{
}

__WEAKDEF void EFM_ProgramEraseError_IrqHandler(void)
{
}

__WEAKDEF void EFM_ColError_IrqHandler(void)
{
}

__WEAKDEF void EFM_OpEnd_IrqHandler(void)
{
}

__WEAKDEF void CLK_XtalStop_IrqHandler(void)
{
}

__WEAKDEF void SWDT_IrqHandler(void)
{
}

__WEAKDEF void TMR0_1_CmpA_IrqHandler(void)
{
}

__WEAKDEF void TMR0_1_CmpB_IrqHandler(void)
{
}

__WEAKDEF void TMR0_2_CmpA_IrqHandler(void)
{
}

__WEAKDEF void TMR0_2_CmpB_IrqHandler(void)
{
}

__WEAKDEF void TMRB_1_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_1_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_1_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_2_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_2_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_2_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_3_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_3_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_3_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_4_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_4_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_4_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_5_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_5_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_5_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMRB_6_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_6_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMRB_6_Cmp_IrqHandler(void)
{
}

__WEAKDEF void TMR4_GCmpUH_IrqHandler(void)
{
}

__WEAKDEF void TMR4_GCmpUL_IrqHandler(void)
{
}

__WEAKDEF void TMR4_GCmpVH_IrqHandler(void)
{
}

__WEAKDEF void TMR4_GCmpVL_IrqHandler(void)
{
}

__WEAKDEF void TMR4_GCmpWH_IrqHandler(void)
{
}

__WEAKDEF void TMR4_GCmpWL_IrqHandler(void)
{
}

__WEAKDEF void TMR4_Ovf_IrqHandler(void)
{
}

__WEAKDEF void TMR4_Udf_IrqHandler(void)
{
}

__WEAKDEF void TMR4_ReloadU_IrqHandler(void)
{
}

__WEAKDEF void TMR4_ReloadV_IrqHandler(void)
{
}

__WEAKDEF void TMR4_ReloadW_IrqHandler(void)
{
}

__WEAKDEF void EMB_GR0_IrqHandler(void)
{
}

__WEAKDEF void EMB_GR1_IrqHandler(void)
{
}

__WEAKDEF void FCM_Error_IrqHandler(void)
{
}

__WEAKDEF void FCM_End_IrqHandler(void)
{
}

__WEAKDEF void FCM_Ovf_IrqHandler(void)
{
}

__WEAKDEF void USART1_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART1_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART1_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART1_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void USART2_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART2_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART2_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART2_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void USART3_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART3_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART3_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART3_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void USART4_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART4_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART4_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART4_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void USART5_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART5_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART5_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART5_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void USART6_RxError_IrqHandler(void)
{
}

__WEAKDEF void USART6_RxFull_IrqHandler(void)
{
}

__WEAKDEF void USART6_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void USART6_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void I2C1_RxFull_IrqHandler(void)
{
}

__WEAKDEF void I2C1_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void I2C1_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void I2C1_EE_IrqHandler(void)
{
}

__WEAKDEF void I2C2_RxFull_IrqHandler(void)
{
}

__WEAKDEF void I2C2_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void I2C2_TxComplete_IrqHandler(void)
{
}

__WEAKDEF void I2C2_EE_IrqHandler(void)
{
}

__WEAKDEF void DCU_IrqHandler(void)
{
}

__WEAKDEF void SPI1_RxFull_IrqHandler(void)
{
}

__WEAKDEF void SPI1_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void SPI1_Idle_IrqHandler(void)
{
}

__WEAKDEF void SPI1_Error_IrqHandler(void)
{
}

__WEAKDEF void SPI2_RxFull_IrqHandler(void)
{
}

__WEAKDEF void SPI2_TxEmpty_IrqHandler(void)
{
}

__WEAKDEF void SPI2_Idle_IrqHandler(void)
{
}

__WEAKDEF void SPI2_Error_IrqHandler(void)
{
}

__WEAKDEF void EKEY_IrqHandler(void)
{
}

__WEAKDEF void ADC_SeqA_IrqHandler(void)
{
}

__WEAKDEF void ADC_SeqB_IrqHandler(void)
{
}

__WEAKDEF void ADC_Cmp0_IrqHandler(void)
{
}

__WEAKDEF void ADC_Cmp1_IrqHandler(void)
{
}

__WEAKDEF void PWC_LVD_IrqHandler(void)
{
}

__WEAKDEF void RTC_Alarm_IrqHandler(void)
{
}

__WEAKDEF void RTC_Period_IrqHandler(void)
{
}

/**
 * @}
 */

#endif /* LL_INTERRUPTS_SHARE_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
